//---------------------------------------------------------------------------
// File: dictionary.h
//---------------------------------------------------------------------------
#pragma once
#ifndef DICTIONARY_H
#define DICTIONARY_H
//---------------------------------------------------------------------------
#include <iostream>
//---------------------------------------------------------------------------
using namespace std;
//---------------------------------------------------------------------------
#define DEBUG 1
#define DICT_LEN 2
#define STEP_ALLOC 5
//--------------------------------------------------------------------------
struct Word
{
	char *en;
	char *ru;
	~Word();
};
//---------------------------------------------------------------------------
class Dictionary
{
	private:
		Word **w;             // Массив слов (пары рус-анг)
		unsigned count, size; // текущее кол-во и размер
		bool mode;            // 1: EN-RU, 0: RU-EN

	public:
		Dictionary();
		~Dictionary();
		char *viewMode();     // Просмотреть режим словаря
		void toggleMode();    // Сменить режим словаря
		void sort(bool type); // Сортировка по алфавиту (0: а-я, 1: я-а)
		void add(char *eng, char *rus);
		//unsigned search(char *word);
		//void del();
		void print(ostream &out);
		void loadWords(istream &in);
};
//---------------------------------------------------------------------------
#endif /* DICTIONARY_H */
//---------------------------------------------------------------------------