//---------------------------------------------------------------------------
#include "dictionary.h"
using namespace std;
//---------------------------------------------------------------------------
void menu(char &c, Dictionary &dict)
{
	system("cls");
	system("chcp 1251 > nul");
	cout << "================= Словарь =================\n";
	cout << "1. Добавить слова в словарь.\n";
	cout << "2. Удалить слова из словаря.\n";
	cout << "3. Перевод слов с английского на русский.\n";
	cout << "4. Перевод слов с русского на английский.\n";
	cout << "5. Просмотр словаря.\n";
	cout << "6. Вывод словаря в файл.\n";
	cout << "7. Выход\n";
	cout << "===========================================\n";
	cout << " Режим словаря: " << dict.viewMode(); 
	cout << endl;
	cout << "===========================================\n";
	if (c != 0) {
		cin.ignore(7777, '\n');
		cin.clear();
	}
	c = cin.get();
}
//---------------------------------------------------------------------------
int main()
{
	char c = 0;
	Dictionary dict;
	do
	{
		menu(c, dict);
		switch (c) {
			case '1':

				break;
			case '2':

				break;
			case '3':

				break;
			case '4':

				break;
			case '5':
				dict.print(cout);
				break;
			case '6':

				break;
			default:
				cout << "No" << endl;
		}
		system("pause");
	} while (c != '7');
	return 0;
}
//---------------------------------------------------------------------------