//---------------------------------------------------------------------------
// File: dictionary.h
//---------------------------------------------------------------------------
#pragma once
#ifndef DICTIONARY_H
#define DICTIONARY_H
//---------------------------------------------------------------------------
#include <iostream>
//---------------------------------------------------------------------------
using namespace std;
//---------------------------------------------------------------------------
#define DEBUG 0        // Вывод отладочной информации вкл/выкл (1/0)
#define DICT_LEN 100   // Изначальная длина словаря
#define MAX_LEN 64     // Максимальная длина слова
//--------------------------------------------------------------------------
class Word
{
	public:
		char en[MAX_LEN]; // Английское слово
		char ru[MAX_LEN]; // Русское слово
		Word();
		Word(const char *eng, const char *rus); 
};
//---------------------------------------------------------------------------
class Dictionary
{
	private:
		Word w[DICT_LEN]; // Массив слов (пары значений руское:английское)
		unsigned count;   // Количество уже заданных слов
		bool mode;        // Режим словаря (1: EN-RU, 0: RU-EN)

	public:
		Dictionary();

		char *viewMode();     // Просмотреть режим словаря
		void toggleMode();    // Сменить режим словаря
		void sort(bool type); // Сортировка по алфавиту (0: а-я, 1: я-а)

		void add(Word new_word); // Добавить слово

		int search(const char *word);              // Двоичный поиск слова
		void translate(istream &in, ostream &out); // Перевод слов

		void del(istream &in);       // Найти и уничтожить все слова word

		void print(ostream &output); // Распечатать весь словарь
		void printWord(ostream &output, unsigned index); // Напечатать слово
		void loadWords(istream &in); // Загрузить слова из потока
};
//---------------------------------------------------------------------------
#endif /* DICTIONARY_H */
//---------------------------------------------------------------------------